# # ##### 2023-1학기 파이썬프로그래밍 (A0019 중간고사) #####
# # # ----------------------------------------------------------------------------------------------------------
# # # 다음과 같은 행위를 부정행위로 간주하며, 온라인 시험 부정행위에 대해서는 관련자 모두를 0점(F)처리하고 학칙에 따라 징계처분 될 수 있으니 유념하시기 바랍니다.
# # # (1) 시험 중 문제나 답안을 전화, SNS, 단톡방, 문제풀이 사이트 등을 통해 공유하는 행위
# # # (2) 시험도중 시험화면을 이탈하거나 특수키(Ctrl, Alt, Window key 등) 사용, 다른 프로그램을 사용하는 행위
# # # (3) 오픈북 시험이 아닌데 교재나 시험관련 자료를 펴놓고 시험을 보는 행위
# # # ----------------------------------------------------------------------------------------------------------

# # # 본인은 온라인 시험 관련 모든 유의사항을 확인하였고 부정행위를 하지 않을 것이며, 부정행위를 하였을 경우에는 0점(F학점)을 감수하며 학칙에 따른 징계절차에 따르겠습니다.
# # # 위의 사항에 동의할 경우 아래 대답에 "동의합니다" 라고 작성해 주십시오.

# # ##### 대답 : 동의합니다.    
# # ##### 학번 : 20201012
# # ##### 이름 : 임소정

#### 1번 문제 #####
id = int(input(A)) + int(input(B))

if B == 5 or B == 0: 
    print("안녕하세요")
else: print("반갑습니다")



# ##### 2번 문제 #####
a = [1, 11, 80, 24, 67, 32, 19, 24, 88]
res=0

for i in a: 
    if i % 2 == 0:
        continue
print(res)


# ##### 3번 문제 #####
b = [1, 2, 3, 4, 5]
c = list[b]
c = reversed.c

print(c)



##### 4번 문제 #####
### coding here ###
for i in 7:
    i = 7
    i == i - 1
print("i "*i)


#### 5번 문제 #####
score = {'국어':90, '영어':95, '수학': 77, '미술':68, '과학':82}
sum = 0
average = 0.0

for i in list[score]:
    sum += score + score
    print("%s 과목의 점수는 %d 입니다."%(i, sum))
average = sum / 5
print("전체 평균은 %f 입니다."%average)





##### 6번 문제 #####
score = [71, 55, 24, 73, 68, 90]

n = 0
for i in score:
    i += i + 1
    if i < 70 :
        delete[n]
    print("%d번 학생 합격"%(n))


# ##### 7번 문제 #####
# capital = {"대한민국": "서울", "미국": "워싱턴", "프랑스": "파리", "영국":"런던", "스위스":"베른", "베트남":"하노이","덴마크":"코펜하겐"}
### coding here ###
capital = {"대한민국": "서울", "미국": "워싱턴", "프랑스": "파리", "영국":"런던", "스위스":"베른", "베트남":"하노이","덴마크":"코펜하겐"}
if str[capital] == 3:
    print("%d의 수도는 %d 입니다."%()%())

# #### 8번 문제 #####
# value = [80, 75, 91, 47, 66, 82, 57, 65, 90, 91, 33, 39, 78, 59, 40, 23, 19, 99, 75, 79, 37, 48, 82, 60, 60, 63, 100, 8, 12, 92, 32, 50, 61, 28, 84, 40, 100, 25, 94, 74, 88, 94, 100, 5, 26]
# # coding here ##
value = [80, 75, 91, 47, 66, 82, 57, 65, 90, 91, 33, 39, 78, 59, 40, 23, 19, 99, 75, 79, 37, 48, 82, 60, 60, 63, 100, 8, 12, 92, 32, 50, 61, 28, 84, 40, 100, 25, 94, 74, 88, 94, 100, 5, 26]
sum = 0
average = 0

for i in list[value]:
    sum += value + value
    average = list[value] / 35
print(average)



#### 9번 문제 #####
visit = ['영국','일본','미국','프랑스','폴란드','칠레','캐나다','이탈리아']
wish = ['브라질', '독일', '캐나다', '호주', '영국']
result = []

if str[visit] == str[wish]:
    
# coding here ##

print(result)